<font color='yellow' size='20'><strong><center>Lección #1: Ciencias de Datos</center></strong></font>

In [1]:
import pandas as pd
import numpy as np

In [28]:
ventas = pd.read_csv(
    '../Data/ventas.csv',
)
comercios = pd.read_csv(
    '../Data/comercios.csv',
)

In [3]:
ventas

   comercio  cliente  valor
0       1.0        1   20.3
1       1.0        2    NaN
2       NaN        2   40.5

In [4]:
comercios

   comercio     ciudad     ubicacion
0         1  Guayaquil  -79.30,-0.23
1         2      Quito  -79.40,-2.15

1. <font color="green">Cuántos registros (observaciones) del dataframe de ventas tienen al menos un campo nulo.<font>

In [7]:
ventas.isnull().any(axis=1).sum()

2

2. <font color="green">Eliminar los registros (observaciones) del dataframe de ventas que tienen nulos en las columnas comercio y valor.</font>

In [30]:
ventas.dropna(subset=['comercio', 'valor'], inplace=True)

In [31]:
ventas

   comercio  cliente  valor
0       1.0        1   20.3

3. <font color='green'>En el dataframe de comercios, extraer la latitud y longitud de la columna ubicación, la columna ubicación es de tipo object. Usted debe crear dos columnas en el dataframe: latitud y longitud con los valores correspondientes.</font>

In [11]:
comercios[['latitud', 'longitud']] = comercios['ubicacion'].str.split(',' , expand=True)

In [12]:
comercios

   comercio     ciudad     ubicacion latitud longitud
0         1  Guayaquil  -79.30,-0.23  -79.30    -0.23
1         2      Quito  -79.40,-2.15  -79.40    -2.15

4. <font color='green'>Cuál es la ciudad que ha registrado el mayor valor total de ventas de los comercios que pertenecen a esa ciudad.</font>

In [20]:
ventas.merge(comercios, on='comercio').groupby('ciudad').agg({'valor': 'sum'}).sort_values('valor', ascending=False).head(1)

           valor
ciudad
Guayaquil   20.3

5. <font color='green'>Se desea agregar una columna "rango" de tipo object al dataset de ventas, que tenga valores de ("Alto, "Medio","Bajo"), según corresponda al rango valor de la venta. Para que sea "Alto" debe ser mayor que 100, "Medio" entre 50 y 100, y "Bajo" menor que 50.</font>

In [22]:
def categorize(row):
    if row['valor'] > 100:
        return 'Alto'
    elif row['valor'] > 50:
        return 'Medio'
    else:
        return 'Bajo'

In [23]:
ventas['rango'] = ventas.apply(categorize, axis=1, result_type='expand')

In [24]:
ventas

   comercio  cliente  valor rango
0       1.0        1   20.3  Bajo
1       1.0        2    NaN  Bajo
2       NaN        2   40.5  Bajo